InformationRegisters/СертификатыПоСпециальностиФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СертификатыПоСпециальностиФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДействуетПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчебноеЗаведение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчебныеЗаведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Специальность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСпециальностейПоОбразованию</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПолучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ХарактеристикиОбъектовДляФедеральныхМедрегистров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ХарактеристикиОбъектовДляФедеральныхМедрегистров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементыКлассификаторовФедеральныхМедрегистров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИсточникЗаполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УченыеСтепени</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыПрофессиональнойПодготовки</v8:Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
						<v8:Type>cfg:CatalogRef.ПрофессиональныеСтандарты</v8:Type>
						<v8:Type>cfg:EnumRef.СостоянияСотрудника</v8:Type>
						<v8:Type>cfg:EnumRef.ОтношениеКВоинскойОбязанности</v8:Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСпециальностейПоОбразованию</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.ОтраслиНауки</v8:Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
						<v8:Type>cfg:CatalogRef.Награды</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
						<v8:Type>cfg:CatalogRef.РазрядыКатегорииДолжностей</v8:Type>
						<v8:Type>cfg:CatalogRef.ОснованияУвольнения</v8:Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Удержания</v8:Type>
						<v8:Type>cfg:EnumRef.КатегорииДолжностейДляСтатистическогоУчета</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыПроцедурАккредитацииСпециалистов</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ОбразованиеФизическихЛиц</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыОбразованияФизическихЛиц</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыКадровыхСобытий</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыЗанятости</v8:Type>
						<v8:Type>cfg:CatalogRef.УчебныеЗаведения</v8:Type>
						<v8:Type>cfg:CatalogRef.СостояниеВБраке</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Классификатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторыФедеральныхМедрегистров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/УчебныеЗаведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>УчебныеЗаведения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/СертификатыПоСпециальностиФизическихЛиц/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ЗаполнитьУчебноеЗаведениеИзКемВыдан");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "ФизическоеЛицо",
		"РегламентированныеДанные");
КонецПроцедуры

#КонецОбласти 

Процедура ЗаполнитьУчебноеЗаведениеИзКемВыдан(ПараметрыОбновления = Неопределено) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("РаботаВМедицинскомУчреждении") Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	РегистрыСведений.ХарактеристикиОбъектовДляФедеральныхМедрегистров.СоздатьВТХарактеристикиОбъектовДляФедеральныхМедрегистров(МенеджерВременныхТаблиц);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("КлассификаторУчебноеЗаведениеСертификата", "1.2.643.5.1.13.13.11.1519");
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1000
	|	СертификатыПоСпециальностиФизическихЛиц.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СертификатыПоСпециальностиФизическихЛиц.Специальность КАК Специальность,
	|	СертификатыПоСпециальностиФизическихЛиц.ДатаПолучения КАК ДатаПолучения,
	|	ВЫРАЗИТЬ(СертификатыПоСпециальностиФизическихЛиц.УдалитьКемВыдан КАК СТРОКА(500)) КАК УдалитьКемВыдан,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(УчебныеЗаведенияПоПолномуНаименованию.Ссылка, ЗНАЧЕНИЕ(Справочник.УчебныеЗаведения.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.УчебныеЗаведения.ПустаяСсылка)
	|			ТОГДА УчебныеЗаведенияПоПолномуНаименованию.Ссылка
	|		КОГДА ЕСТЬNULL(УчебныеЗаведенияПоНаименованию.Ссылка, ЗНАЧЕНИЕ(Справочник.УчебныеЗаведения.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.УчебныеЗаведения.ПустаяСсылка)
	|			ТОГДА УчебныеЗаведенияПоНаименованию.Ссылка
	|		КОГДА ЕСТЬNULL(ХарактеристикиУчебноеЗаведениеПоМедРегистру.Характеристика, ЗНАЧЕНИЕ(Справочник.ЭлементыКлассификаторовФедеральныхМедрегистров.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.ЭлементыКлассификаторовФедеральныхМедрегистров.ПустаяСсылка)
	|			ТОГДА ХарактеристикиУчебноеЗаведениеПоМедРегистру.Объект
	|	КОНЕЦ КАК УчебноеЗаведениеСсылка
	|ИЗ
	|	РегистрСведений.СертификатыПоСпециальностиФизическихЛиц КАК СертификатыПоСпециальностиФизическихЛиц
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УчебныеЗаведения КАК УчебныеЗаведенияПоПолномуНаименованию
	|		ПО ((ВЫРАЗИТЬ(СертификатыПоСпециальностиФизическихЛиц.УдалитьКемВыдан КАК СТРОКА(500))) = УчебныеЗаведенияПоПолномуНаименованию.ПолноеНаименование)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УчебныеЗаведения КАК УчебныеЗаведенияПоНаименованию
	|		ПО ((ВЫРАЗИТЬ(СертификатыПоСпециальностиФизическихЛиц.УдалитьКемВыдан КАК СТРОКА(150))) = УчебныеЗаведенияПоНаименованию.Наименование)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиУчебноеЗаведениеПоМедРегистру
	|		ПО (ХарактеристикиУчебноеЗаведениеПоМедРегистру.ИдентификаторКлассификатора = &КлассификаторУчебноеЗаведениеСертификата)
	|			И ((ВЫРАЗИТЬ(СертификатыПоСпециальностиФизическихЛиц.УдалитьКемВыдан КАК СТРОКА(500))) = ХарактеристикиУчебноеЗаведениеПоМедРегистру.ХарактеристикаНаименование)
	|ГДЕ
	|	СертификатыПоСпециальностиФизическихЛиц.УчебноеЗаведение = ЗНАЧЕНИЕ(Справочник.УчебныеЗаведения.ПустаяСсылка)
	|	И (ВЫРАЗИТЬ(СертификатыПоСпециальностиФизическихЛиц.УдалитьКемВыдан КАК СТРОКА(1))) <> """"";
	
	Если ПараметрыОбновления = Неопределено Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1000", ""); 
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
	
	Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "РегистрСведений.СертификатыПоСпециальностиФизическихЛиц", "", "") Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	ДобавленныеУчебныеЗаведения = Новый Соответствие;
	Пока Выборка.Следующий() Цикл 
		НаборДляИзменения = РегистрыСведений.СертификатыПоСпециальностиФизическихЛиц.СоздатьНаборЗаписей();
		НаборДляИзменения.Отбор.ФизическоеЛицо.Установить(Выборка.ФизическоеЛицо);
		НаборДляИзменения.Отбор.Специальность.Установить(Выборка.Специальность);
		НаборДляИзменения.Отбор.ДатаПолучения.Установить(Выборка.ДатаПолучения);
		НаборДляИзменения.Прочитать();
		ЗаписьДляИзменения = НаборДляИзменения[0];
		Если ЗначениеЗаполнено(Выборка.УчебноеЗаведениеСсылка) Тогда 
	        ЗаписьДляИзменения.УчебноеЗаведение = Выборка.УчебноеЗаведениеСсылка;
		Иначе
			НаименованиеУчебногоЗаведения = Выборка.УдалитьКемВыдан;
			УжеДобавленноеУчебноеЗаведение = ДобавленныеУчебныеЗаведения.Получить(НаименованиеУчебногоЗаведения);
			Если УжеДобавленноеУчебноеЗаведение = Неопределено Тогда
				НовоеУчебноеЗаведение = Справочники.УчебныеЗаведения.СоздатьЭлемент();
				НовоеУчебноеЗаведение.Наименование = НаименованиеУчебногоЗаведения;
				НовоеУчебноеЗаведение.ПолноеНаименование = НаименованиеУчебногоЗаведения;
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(НовоеУчебноеЗаведение);
				НовоеУчебноеЗаведениеСсылка = НовоеУчебноеЗаведение.Ссылка;
	        	ЗаписьДляИзменения.УчебноеЗаведение = НовоеУчебноеЗаведениеСсылка;
				ДобавленныеУчебныеЗаведения.Вставить(НаименованиеУчебногоЗаведения, НовоеУчебноеЗаведениеСсылка);
			Иначе 
	        	ЗаписьДляИзменения.УчебноеЗаведение = УжеДобавленноеУчебноеЗаведение;
			КонецЕсли;
		КонецЕсли;
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборДляИзменения);
	КонецЦикла;

	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
